Конфигурация/InformationRegisters/ОтложенныеЗадания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОтложенныеЗадания</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОтложенныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПерезапускатьПоИстечениюТаймаута</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапускаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОшибкиОтмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФоновогоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сложность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтерактивныйЗапуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ОтложенныеЗадания/Ext/ManagerModule.bsl
Функция ПолучитьТаблицуПараметровПараллельногоЗапускаОтложенныхЗаданий() Экспорт

	ТаблицаПараметров = Новый ТаблицаЗначений;
	ТаблицаПараметров.Колонки.Добавить("Объект",            Метаданные.РегистрыСведений.ОтложенныеЗадания.Измерения.Объект.Тип);
	ТаблицаПараметров.Колонки.Добавить("КоличествоПотоков", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
	
	НоваяСтрока = ТаблицаПараметров.Добавить();
	НоваяСтрока.Объект            = "Обработки.КонтрольСЧА";
	НоваяСтрока.КоличествоПотоков = 3;
	
	Возврат ТаблицаПараметров;

КонецФункции

// Проверяет, что зарегистрировано отложенное задание с плановой датой запуска в указанном периоде,
// находящееся в одном из заданных состояний
//	
//	Параметры:
//		- ДатаНачала 	- начало периода проверки
//		- ДатаОкончания - окончание периода проверки
//		- ПараметрыЗадания - структура с параметрами задания:
//				- Организация 	- организация
//				- Объект 		- СправочникСсылка.ДополнительныеОтчетыИОбработки или Строка
//				- Команда 		- Строка
//				- Состояния 	- ПеречислениСсылка.СостоянияОтложенныхЗаданий или Массив со значениями этого перечисления
//
Функция ЕстьОтложенноеЗадание(ДатаНачала, ДатаОкончания, ПараметрыЗадания) Экспорт
	
	Запрос = Новый Запрос(		 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтложенныеЗадания.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.ОтложенныеЗадания КАК ОтложенныеЗадания
		|ГДЕ
		|	ОтложенныеЗадания.Объект = &Объект
		|	И ОтложенныеЗадания.Организация = &Организация
		|	И ОтложенныеЗадания.ДатаЗапускаПлан МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ОтложенныеЗадания.Команда = &Команда
		|	И ОтложенныеЗадания.Состояние В (&Состояния)");
	
	Запрос.УстановитьПараметр("Объект", 			ПараметрыЗадания.Объект);
	Запрос.УстановитьПараметр("Организация", 		ПараметрыЗадания.Организация);	
	Запрос.УстановитьПараметр("Команда", 			ПараметрыЗадания.Команда);
	Запрос.УстановитьПараметр("Состояния", 			ПараметрыЗадания.Состояния);
	Запрос.УстановитьПараметр("ДатаНачала", 		НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", 		КонецДня(ДатаОкончания));
	
	Возврат Не Запрос.Выполнить().Пустой();
		
КонецФункции
